index.org
#+description: Welcome to my personal website
#+options: num:nil ^:{}
#+SETUPFILE: ~/Documents/Code/web/envixty-hub/org-html-themes/org/theme-readtheorg-local.setup
#+INCLUDE: ~/Documents/Code/web/envixty-hub/header.org
#+TITLE: Welcone to Envixty's Hub

* Envixty's Hub
** About
This website is my personal website I made inside of [[https://github.com/doomemacs/doomemacs][Doom Emacs]] with [[https://orgmode.org/][Org-mode]], And spiced up by using [[https://github.com/fniessen/org-html-themes][Org-HTML-Themes]]!

I am both a gamer, and a free software user.

🕹 My favorite video game right now is [[https://www.counter-strike.net][Counter-Strike: 2]],


💾 I use multiple peices of Free Software like:

- [[https://www.github.com/doomemacs/doomemacs][Doom Emacs]], A config of [[https://www.gnu.org/software/emacs/][GNU EMACS]]

- [[https://neovim.io/][Neovim]], An extensible, terminal based text-editor

- [[https://sw.kovidgoyal.net/kitty/][Kitty]], An Extensible, GPU-Powered Terminal Emulator

- [[https://archlinux.org][Arch Linux]], A distribution of the GNU/Linux system that is a rolling release so I get the newest software first

- [[https://git-scm.com][Git]], Version-Control software for programming, Used on sites like [[https://github.com][Github]], and [[https://gitlab.com][Gitlab]]


** Envixty on the Web
| *Envixty on the Web*              |
|---------------------------------|
| [[https://www.youtube.com/channel/UCYhq-wDCfrMNtXxoFiucZMw][Youtube]]                         |
| [[https://odysee.com/@envixty:e][Odysee]]                          |
| [[https://mastodon.social/@envixty][Mastodon (mastodon.social)]]      |
|---------------------------------|

** Blog Posts

| [[https://redkittty.github.io/blog/personal/my-personal-system.html][My Personal System]] |

** User-Blog Posts

Nothing here yet, to make a blog post, make a pr,

Here are the requirements:

1. Has to be an org-document, cannot be HTML or MARKDOWN

2. Has to use the Blog Post Template as a base (Will Post later)

3. Cannot be plagarized

4. Cannot contain content in regular blog posts


#+INCLUDE: ~/Documents/Code/web/envixty-hub/footer.org
