index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-24 Fri 20:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Envixty's Hub</title>
<meta name="description" content="Welcome to my personal website
Header" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Envixty&rsquo;s Hub</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2e94cde">Welcome to Envixty&rsquo;s Hub</a>
<ul>
<li><a href="#org236a695">About</a></li>
<li><a href="#org6e2e1e5">Envixty on the Web</a></li>
<li><a href="#org378ee06">Blog Posts</a></li>
<li><a href="#orgb814fb2">User-Blog Posts</a></li>
</ul>
</li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://redkittty.github.io">Home</a></td>
<td class="org-left"><a href="https://redkittty.github.io/blog/main.html">Blog</a></td>
</tr>
</tbody>
</table>

<div id="outline-container-org2e94cde" class="outline-2">
<h2 id="org2e94cde">Welcome to Envixty&rsquo;s Hub</h2>
<div class="outline-text-2" id="text-org2e94cde">
</div>
<div id="outline-container-org236a695" class="outline-3">
<h3 id="org236a695">About</h3>
<div class="outline-text-3" id="text-org236a695">
<p>
This website is my personal website I made inside of <a href="https://github.com/doomemacs/doomemacs">Doom Emacs</a> with <a href="https://orgmode.org/">Org-mode</a>, And spiced up by using <a href="https://github.com/fniessen/org-html-themes">Org-HTML-Themes</a>!
</p>

<p>
I am both a gamer, and a free software user.
</p>

<p>
🕹 My favorite video game right now is <a href="https://www.counter-strike.net">Counter-Strike: 2</a>,
</p>


<p>
💾 I use multiple peices of Free Software like:
</p>

<ul class="org-ul">
<li><a href="https://www.github.com/doomemacs/doomemacs">Doom Emacs</a>, A config of <a href="https://www.gnu.org/software/emacs/">GNU EMACS</a></li>

<li><a href="https://neovim.io/">Neovim</a>, An extensible, terminal based text-editor</li>

<li><a href="https://sw.kovidgoyal.net/kitty/">Kitty</a>, An Extensible, GPU-Powered Terminal Emulator</li>

<li><a href="https://archlinux.org">Arch Linux</a>, A distribution of the GNU/Linux system that is a rolling release so I get the newest software first</li>

<li><a href="https://git-scm.com">Git</a>, Version-Control software for programming, Used on sites like <a href="https://github.com">Github</a>, and <a href="https://gitlab.com">Gitlab</a></li>
</ul>
</div>
</div>


<div id="outline-container-org6e2e1e5" class="outline-3">
<h3 id="org6e2e1e5">Envixty on the Web</h3>
<div class="outline-text-3" id="text-org6e2e1e5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Envixty on the Web</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://www.youtube.com/channel/UCYhq-wDCfrMNtXxoFiucZMw">Youtube</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://odysee.com/@envixty:e">Odysee</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://mastodon.social/@envixty">Mastodon (mastodon.social)</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org378ee06" class="outline-3">
<h3 id="org378ee06">Blog Posts</h3>
<div class="outline-text-3" id="text-org378ee06">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://redkittty.github.io/blog/personal/my-personal-system.html">My Personal System</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgb814fb2" class="outline-3">
<h3 id="orgb814fb2">User-Blog Posts</h3>
<div class="outline-text-3" id="text-orgb814fb2">
<p>
Nothing here yet, to make a blog post, make a pr,
</p>

<p>
Here are the requirements:
</p>

<ol class="org-ol">
<li>Has to be an org-document, cannot be HTML or MARKDOWN</li>

<li>Has to use the Blog Post Template as a base (Will Post later)</li>

<li>Cannot be plagarized</li>

<li>Cannot contain content in regular blog posts</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-05-24 Fri 20:45</p>
</div>
</body>
</html>
